src/cf/DataProcessors/пэм_мониторингМетрик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>пэм_мониторингМетрик</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cf/InformationRegisters/инт_ОчередьИсходящихСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>инт_ОчередьИсходящихСообщений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПотокДанных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.инт_ПотокиДанных</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсходныеДанные</Name>
					<Comment>Сериализованное представление исходных данных (ЗначениеВСтрокуВнутр)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СформированноеСообщение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/инт_ИсторияСтатусовИсходящихСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>инт_ИсторияСтатусовИсходящихСообщений</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусСообщения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.инт_СтатусыИсходящихСообщений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/инт_ОчередьВходящихСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>инт_ОчередьВходящихСообщений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВходящееСообщение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПотокДанных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.инт_ПотокиДанных</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/инт_ИсторияСтатусовВходящихСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>инт_ИсторияСтатусовВходящихСообщений</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусСообщения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.инт_СтатусыВходящихСообщений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/инт_ТекущийСтатусИсходящихСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>инт_ТекущийСтатусИсходящихСообщений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусСообщения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.инт_СтатусыИсходящихСообщений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПопыток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСледующейПопытки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/инт_ТекущийСтатусВходящихСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>инт_ТекущийСтатусВходящихСообщений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусСообщения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.инт_СтатусыВходящихСообщений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПопыток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСледующейПопытки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/инт_СтатистикаОбработкиСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>инт_СтатистикаОбработкиСообщений</Name>
			<Comment>Регистр для хранения статистики времени обработки сообщений (формирование, отправка, обработка входящих)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДлительностьМс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Успешно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Подписчик</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.инт_Подписчик</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.инт_ТипыОперацийСтатистики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПотокДанных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.инт_ПотокиДанных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/пэмСостояниеМетрик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>пэмСостояниеМетрик</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстМетрики</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Метрика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.пэмМетрики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/DataProcessors/пэм_мониторингМетрик/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Инициализация периода - последние 24 часа
	Период = Новый СтандартныйПериод(ВариантСтандартногоПериода.Сегодня);
	
	ОбновитьДанныеОтчета();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьДанныеОтчета();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьДанныеОтчета()
	
	ТекстОтчета = СформироватьОтчет();
	
КонецПроцедуры

&НаСервере
Функция СформироватьОтчет()
	
	Результат = Новый Массив;
	
	// Заголовок
	Результат.Добавить("=== МОНИТОРИНГ ИНТЕГРАЦИИ ===");
	Результат.Добавить("");
	Результат.Добавить("Дата формирования: " + Формат(ТекущаяДатаСеанса(), "ДЛФ=DDT"));
	Результат.Добавить("Период: " + Формат(Период.ДатаНачала, "ДЛФ=DD") + " - " + Формат(Период.ДатаОкончания, "ДЛФ=DD"));
	Результат.Добавить("");
	
	// Секция 1: Ключевые показатели
	ДобавитьСекциюКлючевыеПоказатели(Результат);
	
	// Секция 2: Статус очередей
	ДобавитьСекциюСтатусОчередей(Результат);
	
	// Секция 3: Статистика по потокам
	ДобавитьСекциюСтатистикаПоПотокам(Результат);
	
	// Секция 4: Ошибки за период
	ДобавитьСекциюОшибки(Результат);
	
	// Секция 5: Метрики Prometheus
	ДобавитьСекциюМетрикиPrometheus(Результат);
	
	Возврат СтрСоединить(Результат, Символы.ПС);
	
КонецФункции

&НаСервере
Процедура ДобавитьСекциюКлючевыеПоказатели(Результат)
	
	Результат.Добавить("--- 1. КЛЮЧЕВЫЕ ПОКАЗАТЕЛИ ---");
	Результат.Добавить("");
	
	ДатаНачала = Период.ДатаНачала;
	ДатаОкончания = ?(ЗначениеЗаполнено(Период.ДатаОкончания), КонецДня(Период.ДатаОкончания), КонецДня(ТекущаяДатаСеанса()));
	
	// Исходящие сообщения - всего в очереди
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ инт_ОчередьИсходящихСообщений.ИдентификаторСообщения) КАК Всего
	|ИЗ
	|	РегистрСведений.инт_ОчередьИсходящихСообщений КАК инт_ОчередьИсходящихСообщений";
	
	Выборка = Запрос.Выполнить().Выбрать();
	ВсегоИсходящих = 0;
	Если Выборка.Следующий() Тогда
		ВсегоИсходящих = Выборка.Всего;
	КонецЕсли;
	
	// Исходящие сообщения за период
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ инт_ИсторияСтатусовИсходящихСообщений.ИдентификаторСообщения) КАК ЗаПериод
	|ИЗ
	|	РегистрСведений.инт_ИсторияСтатусовИсходящихСообщений КАК инт_ИсторияСтатусовИсходящихСообщений
	|ГДЕ
	|	инт_ИсторияСтатусовИсходящихСообщений.Период >= &ДатаНачала
	|	И инт_ИсторияСтатусовИсходящихСообщений.Период <= &ДатаОкончания";
	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	
	Выборка = Запрос.Выполнить().Выбрать();
	ИсходящихЗаПериод = 0;
	Если Выборка.Следующий() Тогда
		ИсходящихЗаПериод = Выборка.ЗаПериод;
	КонецЕсли;
	
	// Входящие сообщения - всего в очереди
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ инт_ОчередьВходящихСообщений.ИдентификаторСообщения) КАК Всего
	|ИЗ
	|	РегистрСведений.инт_ОчередьВходящихСообщений КАК инт_ОчередьВходящихСообщений";
	
	Выборка = Запрос.Выполнить().Выбрать();
	ВсегоВходящих = 0;
	Если Выборка.Следующий() Тогда
		ВсегоВходящих = Выборка.Всего;
	КонецЕсли;
	
	// Входящие сообщения за период
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ инт_ИсторияСтатусовВходящихСообщений.ИдентификаторСообщения) КАК ЗаПериод
	|ИЗ
	|	РегистрСведений.инт_ИсторияСтатусовВходящихСообщений КАК инт_ИсторияСтатусовВходящихСообщений
	|ГДЕ
	|	инт_ИсторияСтатусовВходящихСообщений.Период >= &ДатаНачала
	|	И инт_ИсторияСтатусовВходящихСообщений.Период <= &ДатаОкончания";
	
	Выборка = Запрос.Выполнить().Выбрать();
	ВходящихЗаПериод = 0;
	Если Выборка.Следующий() Тогда
		ВходящихЗаПериод = Выборка.ЗаПериод;
	КонецЕсли;
	
	// Активные потоки
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(*) КАК Количество
	|ИЗ
	|	Справочник.инт_ПотокиДанных КАК инт_ПотокиДанных
	|ГДЕ
	|	НЕ инт_ПотокиДанных.ПометкаУдаления
	|	И инт_ПотокиДанных.Активен";
	
	Выборка = Запрос.Выполнить().Выбрать();
	АктивныхПотоков = 0;
	Если Выборка.Следующий() Тогда
		АктивныхПотоков = Выборка.Количество;
	КонецЕсли;
	
	Результат.Добавить("Исходящие сообщения:");
	Результат.Добавить("  • Всего в очереди: " + Формат(ВсегоИсходящих, "ЧН=0; ЧГ="));
	Результат.Добавить("  • За период: " + Формат(ИсходящихЗаПериод, "ЧН=0; ЧГ="));
	Результат.Добавить("");
	Результат.Добавить("Входящие сообщения:");
	Результат.Добавить("  • Всего в очереди: " + Формат(ВсегоВходящих, "ЧН=0; ЧГ="));
	Результат.Добавить("  • За период: " + Формат(ВходящихЗаПериод, "ЧН=0; ЧГ="));
	Результат.Добавить("");
	Результат.Добавить("Активных потоков данных: " + Формат(АктивныхПотоков, "ЧН=0; ЧГ="));
	Результат.Добавить("");
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСекциюСтатусОчередей(Результат)
	
	Результат.Добавить("--- 2. СТАТУС ОЧЕРЕДЕЙ ---");
	Результат.Добавить("");
	
	// Статус исходящих сообщений
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	инт_ТекущийСтатусИсходящихСообщений.СтатусСообщения КАК Статус,
	|	КОЛИЧЕСТВО(*) КАК Количество
	|ИЗ
	|	РегистрСведений.инт_ТекущийСтатусИсходящихСообщений КАК инт_ТекущийСтатусИсходящихСообщений
	|СГРУППИРОВАТЬ ПО
	|	инт_ТекущийСтатусИсходящихСообщений.СтатусСообщения
	|УПОРЯДОЧИТЬ ПО
	|	Количество УБЫВ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Результат.Добавить("Исходящие:");
	Пока Выборка.Следующий() Цикл
		Результат.Добавить("  • " + Строка(Выборка.Статус) + ": " + Формат(Выборка.Количество, "ЧН=0; ЧГ="));
	КонецЦикла;
	Результат.Добавить("");
	
	// Статус входящих сообщений
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	инт_ТекущийСтатусВходящихСообщений.СтатусСообщения КАК Статус,
	|	КОЛИЧЕСТВО(*) КАК Количество
	|ИЗ
	|	РегистрСведений.инт_ТекущийСтатусВходящихСообщений КАК инт_ТекущийСтатусВходящихСообщений
	|СГРУППИРОВАТЬ ПО
	|	инт_ТекущийСтатусВходящихСообщений.СтатусСообщения
	|УПОРЯДОЧИТЬ ПО
	|	Количество УБЫВ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Результат.Добавить("Входящие:");
	Пока Выборка.Следующий() Цикл
		Результат.Добавить("  • " + Строка(Выборка.Статус) + ": " + Формат(Выборка.Количество, "ЧН=0; ЧГ="));
	КонецЦикла;
	Результат.Добавить("");
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСекциюСтатистикаПоПотокам(Результат)
	
	Результат.Добавить("--- 3. СТАТИСТИКА ПО ПОТОКАМ ---");
	Результат.Добавить("");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	инт_СтатистикаОбработкиСообщений.ПотокДанных.Наименование КАК НаименованиеПотока,
	|	КОЛИЧЕСТВО(*) КАК КоличествоОпераций,
	|	СУММА(инт_СтатистикаОбработкиСообщений.ДлительностьМс) КАК СуммарнаяДлительностьМс
	|ИЗ
	|	РегистрСведений.инт_СтатистикаОбработкиСообщений КАК инт_СтатистикаОбработкиСообщений
	|ГДЕ
	|	инт_СтатистикаОбработкиСообщений.Период >= &ДатаНачала
	|	И инт_СтатистикаОбработкиСообщений.Период <= &ДатаОкончания
	|СГРУППИРОВАТЬ ПО
	|	инт_СтатистикаОбработкиСообщений.ПотокДанных.Наименование
	|УПОРЯДОЧИТЬ ПО
	|	КоличествоОпераций УБЫВ";
	
	Запрос.УстановитьПараметр("ДатаНачала", Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ?(ЗначениеЗаполнено(Период.ДатаОкончания), КонецДня(Период.ДатаОкончания), КонецДня(ТекущаяДатаСеанса())));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ЕстьДанные = Ложь;
	Пока Выборка.Следующий() Цикл
		ЕстьДанные = Истина;
		СредняяМс = 0;
		Если Выборка.КоличествоОпераций > 0 Тогда
			СредняяМс = Окр(Выборка.СуммарнаяДлительностьМс / Выборка.КоличествоОпераций, 1);
		КонецЕсли;
		ВремяСек = Окр(Выборка.СуммарнаяДлительностьМс / 1000, 2);
		
		Результат.Добавить(Выборка.НаименованиеПотока + ":");
		Результат.Добавить("  • Операций: " + Формат(Выборка.КоличествоОпераций, "ЧН=0; ЧГ="));
		Результат.Добавить("  • Общее время: " + Формат(ВремяСек, "ЧН=0; ЧГ=") + " сек");
		Результат.Добавить("  • Среднее: " + Формат(СредняяМс, "ЧН=0; ЧГ=") + " мс");
		Результат.Добавить("");
	КонецЦикла;
	
	Если НЕ ЕстьДанные Тогда
		Результат.Добавить("Нет данных за период");
		Результат.Добавить("");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСекциюОшибки(Результат)
	
	Результат.Добавить("--- 4. ОШИБКИ ЗА ПЕРИОД ---");
	Результат.Добавить("");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 10
	|	Т.ИдентификаторСообщения КАК ИдентификаторСообщения,
	|	Т.Период КАК Период,
	|	Т.ТекстОшибки КАК ТекстОшибки,
	|	Т.СтатусСообщения КАК СтатусСообщения
	|ИЗ
	|	РегистрСведений.инт_ИсторияСтатусовИсходящихСообщений КАК Т
	|ГДЕ
	|	Т.Период >= &ДатаНачала
	|	И Т.Период <= &ДатаОкончания
	|	И ПОДСТРОКА(Т.ТекстОшибки, 1, 1) <> """"
	|УПОРЯДОЧИТЬ ПО
	|	Т.Период УБЫВ";
	
	Запрос.УстановитьПараметр("ДатаНачала", Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ?(ЗначениеЗаполнено(Период.ДатаОкончания), КонецДня(Период.ДатаОкончания), КонецДня(ТекущаяДатаСеанса())));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	НомерОшибки = 0;
	Пока Выборка.Следующий() Цикл
		НомерОшибки = НомерОшибки + 1;
		
		ТекстОшибки = Выборка.ТекстОшибки;
		Если СтрДлина(ТекстОшибки) > 100 Тогда
			ТекстОшибки = Лев(ТекстОшибки, 97) + "...";
		КонецЕсли;
		
		Результат.Добавить("[" + НомерОшибки + "] " + Формат(Выборка.Период, "ДЛФ=DDT"));
		Результат.Добавить("    Статус: " + Строка(Выборка.СтатусСообщения));
		Результат.Добавить("    " + ТекстОшибки);
		Результат.Добавить("");
	КонецЦикла;
	
	Если НомерОшибки = 0 Тогда
		Результат.Добавить("[OK] Ошибок не обнаружено");
		Результат.Добавить("");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСекциюМетрикиPrometheus(Результат)
	
	Результат.Добавить("--- 5. МЕТРИКИ PROMETHEUS ---");
	Результат.Добавить("");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	пэмСостояниеМетрик.Метрика.Наименование КАК Наименование,
	|	пэмСостояниеМетрик.ДатаРасчета КАК ДатаРасчета,
	|	пэмСостояниеМетрик.Длительность КАК Длительность
	|ИЗ
	|	РегистрСведений.пэмСостояниеМетрик КАК пэмСостояниеМетрик
	|ГДЕ
	|	пэмСостояниеМетрик.Метрика.Наименование ПОДОБНО ""pde_%""
	|УПОРЯДОЧИТЬ ПО
	|	пэмСостояниеМетрик.Метрика.Наименование";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ЕстьДанные = Ложь;
	Пока Выборка.Следующий() Цикл
		ЕстьДанные = Истина;
		Результат.Добавить(Выборка.Наименование + ":");
		Результат.Добавить("  • Длительность: " + Формат(Выборка.Длительность, "ЧН=0; ЧГ=") + " мс");
		Результат.Добавить("  • Расчет: " + Формат(Выборка.ДатаРасчета, "ДЛФ=DT"));
		Результат.Добавить("");
	КонецЦикла;
	
	Если НЕ ЕстьДанные Тогда
		Результат.Добавить("Нет метрик pde_*");
		Результат.Добавить("");
	КонецЕсли;
	
	Результат.Добавить("=== КОНЕЦ ОТЧЁТА ===");
	
КонецПроцедуры

#КонецОбласти
